/* Go back action title */
"Back" = "Takaisin";

/* Continue action title */
"Continue" = "Jatka";

/* Setup a new printer title */
"Set Up New Printer" = "Aseta uusi tulostin";

/* Application name */
"HP Easy Wireless Setup" = "HP Easy Wireless Setup";

/* HP Smart print details explanation */
"In just a few steps, you can start using your HP printer." = "Vain muutaman vaiheen jälkeen voit alkaa käyttää HP-tulostintasi.";

/* Prepare printer message */
"Prepare" = "Valmistele";

/* Click continue message on prepare printer view */

/* Ensure power is on message on prepare printer view */
"Power is ON" = "Virta on päällä";


/* Unconfigured printer display name */
"New Wireless Printer" = "Uusi langaton tulostin";

/* Printer selection view title */
"Connect" = "Yhdistä";

/* Printer selection view description */
"Click Continue to set up a new wireless printer, or click Show All to select a printer that is already connected." = "Napsauta Jatka ja aseta uusi langaton tulostin tai napsauta Näytä kaikki ja valitse tulostin, joka on jo yhdistetty.";

/* Show all printers button title */
"Show All" = "Näytä kaikki";

/*////////////////////////////////////////////////////////////////////////////*/
/*                                                                            */
/*                         	Printer configuration                           */
/*                                                                            */
/*////////////////////////////////////////////////////////////////////////////*/

/* Printer confuguration view description */
"Follow these steps to add your printer to your Wi-Fi network." = "Noudata näitä vaiheita ja lisää tulostin Wi-Fi-verkkoon.";

/* Connect to HP-Setup- network title */
"Connect your Mac to the printer" = "Yhdistä Mac tulostimeen";

/* Connect to HP-Setup- network explanation */
"Click the Wi-Fi icon in the menu bar and choose the printer's network (starts with \"HP-Setup\")." = "Napsauta valikkopalkissa Wi-Fi-kuvaketta ja valitse tulostimen verkko (alkaa nimellä \"HP-Setup\").";

/* Join network step title */

/* Connect to known network message */
"Click the Wi-Fi icon in the menu bar, and select your printer network (%@)" = "Napsauta valikkopalkissa Wi-Fi-kuvaketta ja valitse tulostimen verkko (%@)";

/* Restore WiFi network step title */
"Restore your Mac's original Wi-Fi setting" = "Palauta Macin alkuperäisen Wi-Fi-asetus";

/* Generic network name in lowercase */
"your network" = "verkkosi";

/* Restore WiFi network step explanation */
"Click the Wi-Fi icon in the menu bar and choose the %@ network." = "Napsauta valikkopalkissa Wi-Fi-kuvaketta ja valitse %@ -verkko.";
"Click the Wi-Fi icon in the menu bar, choose \"Join Other Network\", and connect to the %@ network." = "Napsauta Wi-Fi-kuvaketta valikkopalkissa. Valitse \"Liity muuhun verkkoon\" ja yhdistä %@ -verkkoon.";

/* Generic network name */
"Your network" = "Verkkosi";

/* Password description format */
"The Wi-Fi network%1$@requires a%2$@password." = "Wi-Fi-verkko %1$@vaatii %2$@salasanan.";

/* Password title */
"Password:" = "Salasana:";

/* Cancel button title */
"Cancel" = "Peruuta";

/* OK button title */
"OK" = "OK";

/* Try again button title */
"Try Again" = "Yritä uudelleen";


/* Default button of alert on timeout while restoring connection */
"Wait" = "Odota";

/* Alternate button of alert on timeout while restoring connection */
"Reconfigure" = "Määritä uudelleen";

/* Network joining error description */
"Make sure the network name and password are correct, try again later, or select another network from the list." = "Varmista, että verkon nimi ja salasana ovat oikein, yritä uudelleen myöhemmin tai valitse toinen verkko luettelosta.";

/* Other button of alert on timeout while restoring connection */
"Cancel" = "Peruuta";

/* Message text of the alert when connecting to unsupported network */
"Cannot connect to the network \"%@\"" = "Ei voi muodostaa yhteyttä verkkoon \"%@\"";

/* Informative text of the alert when connecting to unsupported network */
"The network \"%1$@\" has the %2$@ encryption type. This encryption type is not supported." = "Verkolla \"%1$@\" on %2$@ -salaustyyppi. Tätä salaustyyppiä ei tueta.";

/*////////////////////////////////////////////////////////////////////////////*/
/*                                                                            */
/*                        Print test page controller                          */
/*                                                                            */
/*////////////////////////////////////////////////////////////////////////////*/

/* Add and print screen messages */
"Follow the steps below to prepare for printing." = "Valmistele tulostus noudattamalla näitä vaiheita.";
"Click Add Printer. A new window will open." = "Napsauta Lisää tulostin. Uusi ikkuna aukeaa.";
"Add Printer..." = "Lisää tulostin…";
"In the newly opened window:" = "Juuri avatussa ikkunassa:";
"Choose \"%1$@\" from the %2$@ pop-up menu." = "Valitse \"%1$@\" %2$@ -ponnahdusvalikosta.";
"Use" = "Käyttö";
"Print Using" = "Tulostuslaite";


"Click Add." = "Napsauta Lisää.";
"To ascertain that the printer has been successfully configured, place a sheet of %@ paper in the printer's paper tray, and then click Print Test Page." = "Varmista, että tulostimen määritys on oikein asettamalla %@ -paperiarkki tulostimen paperilokeroon ja napsauttamalla Tulosta testisivu.";

"Print Test Page" = "Tulosta testisivu";

/* The name of the print job */
"Test Page" = "Testisivu";

"Add and Verify" = "Lisää ja vahvista";


/*////////////////////////////////////////////////////////////////////////////*/
/*                                                                            */
/*                         Join other network sheet                           */
/*                                                                            */
/*////////////////////////////////////////////////////////////////////////////*/

/* Join other network sheet title */
"Find and join a Wi-Fi network." = "Etsi ja liitä Wi-Fi-verkkoon.";

/* Join other network description label */
"Enter the name and security type of the network you want to join." = "Kirjoita sen verkon nimi ja suojaustyyppi, johon haluat liittyä.";

/* Network name label */
"Network Name:" = "Verkon nimi:";

/* Security type label */
"Security:" = "Suojaus:";

/* Password label */
"Password:" = "Salasana:";

/* Show password checkbox title */
"Show password" = "Näytä salasana";

/*////////////////////////////////////////////////////////////////////////////*/
/*                                                                            */
/*                   			     Rename printer       		                  */
/*                                                                            */
/*////////////////////////////////////////////////////////////////////////////*/

"Apply" = "Käytä";

"Done" = "Valmis";

/*////////////////////////////////////////////////////////////////////////////*/
/*                                                                            */
/*               			     Network popup												*/
/*                                                                            */
/*////////////////////////////////////////////////////////////////////////////*/

"Refreshing Networks..." = "Päivitetään verkkoja…";
"No Networks Found" = "Verkkoja ei löydy";
"%d Networks Found" = "%d verkkoa löytynyt";
"Join Other Network..." = "Liity muuhun verkkoon…";

/*////////////////////////////////////////////////////////////////////////////*/
/*                                                                            */
/*               			   Network selection tutorial									*/
/*                                                                            */
/*////////////////////////////////////////////////////////////////////////////*/

"Wi-Fi: On" = "Wi-Fi: päällä";
"Turn Wi-Fi Off" = "Laita Wi-Fi pois päältä";
"HP-Setup..." = "HP-Setup…";
"Home" = "Etusivu";
"Create Network..." = "Luo verkko…";
"Open Network Preferences..." = "Avaa Verkko-asetukset…";

/*////////////////////////////////////////////////////////////////////////////*/
/*                                                                            */
/*                        Login and password sheet                            */
/*                                                                            */
/*////////////////////////////////////////////////////////////////////////////*/

"%1$@ is trying to change your print settings. Type your password to allow this." = "%1$@ yrittää muuttaa tulostusasetuksiasi. Salli tämä kirjoittamalla salasanasi.";

"%1$@ is trying to change your print settings. Type an administrator's name and password to allow this." = "%1$@  yrittää muuttaa tulostusasetuksiasi. Salli tämä kirjoittamalla pääkäyttäjän nimi ja salasana.";

"Account name:" = "Tilin nimi:";


/*////////////////////////////////////////////////////////////////////////////*/
/*                                                                            */
/*                           Non HP driver sheet                              */
/*                                                                            */
/*////////////////////////////////////////////////////////////////////////////*/



"Use the Current Driver" = "Käytä nykyistä ohjainta";

"Switch to the HP Driver" = "Vaihda HP:n ohjaimeen";

/*////////////////////////////////////////////////////////////////////////////*/
/*                                                                            */
/*                          Network Encryption types                          */
/*                                                                            */
/*////////////////////////////////////////////////////////////////////////////*/
"none" = "Ei mitään";
"wpa_psk_or_wpa2" = "WPA/WPA2 Personal";
"wpa_enterprise" = "WPA Enterprise";
"wpa2_enterprise" = "WPA2 Enterprise";
"wpa_psk" = "WPA Personal";
"wpa2" = "WPA2 Personal";

/*////////////////////////////////////////////////////////////////////////////*/
/*                                                                            */
/*                                 Plus version                               */
/*                                                                            */
/*////////////////////////////////////////////////////////////////////////////*/
/* Finish setup screen strings */
"Preparing to open HP Utility..." = "Valmistaudutaan avaamaan HP Utility...";
"Thank You!" = "Kiitos!";
"Continue with HP Utility" = "Jatka HP Utility käyttämistä";
"Click Open HP Utility and then follow the steps presented. Once HP Utility has opened, HP Easy Start will automatically close." = "Valitse Avaa HP Utility ja seuraa ohjeita. Kun HP Utility on avautunut, HP Easy Start sulkeutuu automaattisesti.";
"Cannot open HP Utility." = "HP Utility ei voida avata.";
"Open HP Utility..." = "Avaa HP Utility...";
"Now that you are connected and essential software is installed, use HP Utility to complete remaining printer setup tasks." = "Nyt kun yhteys on muodotettu ja tarpeelliset ohjelmistot on asennettu, voit saattaa jäljellä olevat tulostustyöt loppuun HP Utility avulla.";


/* Software installation strings */
"We were not able to automatically locate any software options for this product. Please go to the HP Website and search for product solutions there." = "Tälle tuotteelle ei löytynyt ohjelmistovaihtoehtoja automaattisesti. Siirry HP:n sivustoon ja etsi tuoteratkaisuja sieltä.";
"Searching for software..." = "Etsitään ohjelmistoa...";
"Install" = "Asenna";
"Recommended" = "Suositeltu";
"Installing... %.1f%%" = "Asennetaan... %.1f%%";
"Loading..." = "Ladataan...";
/* Description text for alert on error happened during enabling Web Services */
"The HP Web Services for your device could not be activated" = "HP-verkkopalveluiden käyttöönotto laitteellasi epäonnistui";

/* Solution text for alert on error happened during enabling Web Services */
"Please make sure the device is connected to the Internet and has proper proxy settings." = "Varmista, että laite on yhdistetty Internetiin ja sen välityspalvelinasetukset ovat oikein.";

/* Short status message for installation process stalled */
"System activity in progress, please wait…." = "Järjestelmän toiminto on kesken. Odota….";

"Cannot obtain software information." = "Ohjelmiston tietoja ei saada.";
"Cannot install software." = "Ohjelmistoa ei voida asentaa.";
"Go back to the previous step and try to install the software again." = "Palaa edelliseen vaiheeseen ja yritä asentaa ohjelmisto uudelleen.";
"%@ is busy" = "%@ on varattu";
"Downloading... %@" = "Ladataan... %@";
"Update available" = "Päivitys saatavissa";
"Downloaded" = "Ladattu";
"Version: %@" = "Versio: %@";
"Status: %@" = "Tila: %@";
"Installed successfully" = "Asennus onnistui";
"The software cannot be installed. Try again later." = "Ohjelmistoa ei voida asentaa. Yritä uudelleen myöhemmin.";
"Cannot connect to server" = "Palvelimeen ei saada yhteyttä";
"Required" = "Pakollinen";
"Up to date" = "Päivitetty";
"Not Installed" = "Ei asennettu";
"Software installation requires authorization." = "Ohjelmiston asentaminen vaatii hyväksyntää.";
"Cannot obtain software information. Check your network connection, and then try again." = "Ohjelmiston tietoja ei saada. Tarkista verkkoyhteysi tila ja yritä uudelleen.";
"Cannot download the software." = "Ohjelmistoa ei voida ladata.";
"Check your network connection, and then try again." = "Tarkista verkkoyhteysi tila ja yritä uudelleen.";
"Waiting..." = "Odotetaan...";
"Connecting..." = "Yhdistetään...";


/* Print Queue Setup */
"Would you like to use the HP printer driver?" = "Haluatko käyttää HP:n tulostinohjainta?";
"Select \"%@\"" = "Valitse \"%@\"";

/* Setup printer by IP address instruction */
"Select the IP tab and then enter %@ in the Address field." = "Valitse IP-välilehti ja syötä %@ osoitekenttään.";

"Choose \"%@\" from the Protocol pop-up menu." = "Valitse Protokolla-pikavalikosta \"%@\".";
"Choose a protocol supported by your printer from the Protocol pop-up menu." = "Valitse Protokolla-pikavalikosta tulostimen tukema protokolla.";


"Generic PostScript Printer" = "Yleinen PostScript-tulostin";
"Generic PCL Printer" = "Yleinen PCL-tulostin";

/* Printer search/discovery */
"Ready to Connect" = "Valmis yhteyden muodostamiseen";
"Search for IP address: %@" = "Etsi IP-osoite: %@";
"Searching..." = "Etsitään...";
"No devices have been found." = "Yhtään laitetta ei löytynyt.";
"No devices have been found" = "Yhtään laitetta ei löytynyt";

"Search for host name: %@" = "Etsi isännän nimi: %@";

/* Printer configuration */
"More..." = "Lisää...";
"About HP Auto Wireless Connect" = "Tietoja HP:n automaattisesta langattomasta yhteydestä";

/* Connect device to Wi-Fi network screen description */
"Click on the label under device icon and give your device a name that will be easy to recognize, make sure your Mac’s current Wi-Fi network is selected, and then click Join." = "Osoita laitekuvakkeen alla olevaa merkkiä ja anna laitteelle helposti tunnistettava nimi. Varmista, että Mac-tietokoneen nykyinen Wi-Fi-verkko on valittu ja valitse Liitä.";

/* Join button title */
"Join" = "Liitä";

/* Join device to Wi-Fi network connection notes */
"Note: When you click Join, your Mac will be temporarily disconnected from your wireless network. %@" = "Huomautus: Kun valitset Liitä, Mac-tietokoneen langaton yhteys katkeaa tilapäisesti. %@";


/* Preferences window title */
"Preferences" = "Oletusasetukset";

/* Error messages */

"Cannot connect to the selected network." = "Valittuun verkkoon ei saada yhteyttä.";
"Cannot configure the printer." = "Tulostinta ei voida määrittää.";

/* 1.1 Resources */

/* Displayed when user network set up to use manual IP address and app needs to temporary reconfigure network */

/* Displayed when user tries to quit app during system configuration change */
"You cannot quit the application while changes are being applied." = "Et voi sulkea sovellusta muutosten teon aikana.";

/* 5GHz incompatibility alerts */

/* Message displayed on test page */
"Printing is enabled" = "Tulostus on käytössä";

/* Displayed when user tries to quit app during software installayion */
"You cannot quit the application during installation. Wait until the installation is completed." = "Et voi sulkea sovellusta asennuksen aikana. Odota, että asennus on valmis.";

/* Reminders */
"Remind Me..." = "Muistuta minua...";
"Set reminders to explore and install free HP-recommended software." = "Aseta muistutuksia, jotta voit tutustua HP:n suosittelemiin maksuttomiin ohjelmistoihin ja asentaa niitä.";
"Checking for software..." = "Etsitään ohjelmistoja...";

/* Displayed name of the application home page link in reminders view */
"Home Page" = "Aloitussivu";

/* Reminder time options */
"30 minutes" = "30 minuuttia";
"1 hour" = "1 tunti";
"1 day" = "1 päivä";
"No reminders" = "Ei muistutuksia";

"Enable Printing" = "Ota tulostus käyttöön";

"You cannot quit the application." = "Et voi sulkea sovellusta.";


/* Reminders screen title  and description for case reminders are not available (10.7) */
"Other Software" = "Muut ohjelmistot";
"Explore and install free HP recommended software." = "Tutustu HP:n suosittelemiin maksuttomiin ohjelmistoihin ja asenna niitä.";

/* Reminders screen description for case when reminders are unallowed for the app */
"Please allow %@ to access your reminders in the Security & Privacy system preferences pane" = "Salli, että %@ voi käyttää Suojaus ja yksityisyys -järjestelmäasetusten paneelia.";

/* Caption of the network selection pop-up button when no network is selected and join button is disabled */
"Select the network" = "Valitse verkko";

/* Printer setup */

/* Info button title */
"More Info" = "Lisätietoja";


/*////////////////////////////////////////////////////////////////////////////*/
/*                                                                            */
/*                                     2.0                                    */
/*                                                                            */
/*////////////////////////////////////////////////////////////////////////////*/

"%1$@ may have been deleted or moved to another location. Quit and then reopen %1$@, and try again." = "%1$@ on voitu poistaa tai siirtää toiseen paikkaan. Lopeta, avaa %1$@ sitten uudelleen ja yritä uudelleen.";
"Cannot complete operation" = "Toimintoa ei voi suorittaa loppuun";
"Are you sure that you want to skip Online Setup steps?" = "Haluatko varmasti ohittaa Online-asennuksen vaiheet?";
"Skip" = "Ohita";
"Online Setup is an important part of the complete setup of your printer. Certain product features may not be available to you until these steps are completed." = "Online-asennus on tärkeä osa tulostimen asetusten määrittämistä. Osa tuotteen toiminnoista saattaa olla käytettävissä vasta, kun nämä toimenpiteet on suoritettu.";
"Unable to communicate with the printer." = "Viestintä tulostimen kanssa epäonnistui.";

/* Printer is not found title */
"No devices found that match search criteria" = "Hakuehtoja vastaavia laitteita ei löytynyt";

/* Description for case when the printer is not found during the filtering */
"Make sure that your device is powered on, and already connected to your network or via USB or ready to connect to your wireless network. Also check the product name, or assigned name for the networked device, and ensure that your search information is typed correctly. Click the Information button for more tips to follow if your device is still not found." = "Tarkista, että laitteeseesi on kytketty virta ja että laite on jo yhdistetty verkkoon tai USB-asemaan tai valmiina yhdistettäväksi langattomaan verkkoon. Tarkista myös tuotteen nimi tai verkkoon yhdistetylle laitteelle määritetty nimi ja varmista, että hakutiedot on annettu oikein. Jos laitettasi ei edelleenkään löydy, valitse tietopainike, jotta saat lisää vinkkejä ongelman ratkaisemiseen.";

/* Description for case when the printer is not found during search by IP-address or host name */

/* Incorrect queue creation alert title and description */
"Printing was not enabled" = "Tulostusta ei otettu käyttöön.";
"Printing was not enabled successfully during the previous steps. This appears to have been caused by an incorrect printer selection in the Add Printer dialog. Please perform these steps again and pay close attention to the selections that you make." = "Tulostuksen käyttöönottaminen aiempien vaiheiden aikana ei onnistunut. Tämä näyttää johtuvan väärästä tulostinvalinnasta Lisää tulostin -ikkunassa. Suorita nämä vaiheet uudelleen ja tee valinnat huolellisesti.";

"To connect the printer, complete the following steps. After you complete each step, click \"Try Again\".\n\n1. Make sure all printer cables are securely connected or that the wireless connection is working properly.\n\n2. Turn the printer off, and then turn it on again" = "Liitä tulostin suorittamalla seuraavat toimenpiteet. Valitse Yritä uudelleen kunkin vaiheen jälkeen.\n\n1. Varmista, että kaikki tulostimen johdot on kunnolla kiinni tai että langaton yhteys toimii asianmukaisesti.\n\n2. Sammuta tulostin ja käynnistä se sitten uudelleen.";

"Username:" = "Käyttäjänimi:";

/* Conclusion screen title */
"Continue Online" = "Jatka verkossa";

/* Conclusion screen description */
"Now that you are connected and essential software is installed, remaining printer setup tasks will occur online." = "Nyt kun olet muodostanut yhteyden ja oleellinen ohjelmisto on asennettu, jäljellä olevat tulostimen määritystoimet suoritetaan verkossa.";

/* Continue Online button title */
"Continue Online..." = "Jatka verkossa…";

/* Continue Online action description */
"Click Continue Online to open your Web browser and then follow the steps presented. Once your browser has opened, HP Easy Start will automatically close." = "Avaa verkkoselain valitsemalla Jatka verkossa ja noudata sitten annettuja ohjeita. Kun selain on auki, HP Easy Start sulkeutuu automaattisesti.";

/* Skip Online Setup alert buttons */
"Continue Online Setup" = "Jatka asetusten määritystä verkossa";
"Skip Online Setup" = "Ohita asetusten määritys verkossa";

/* Finishing OWS setup progress title */
"Finishing setup..." = "Viimeistellään asetusten määritystä...";

/* No-devices-found instruction */
"Make sure that the device is powered on, all cables are connected, and wireless access is enabled on the device. Click the Information button for more tips to follow if your device is still not found." = "Varmista, että laitteeseen on kytketty virta, että kaikki johdot on kytketty ja että laitteella on otettu käyttöön langaton yhteys. Jos laitettasi ei vieläkään löydy, saat lisää vinkkejä napsauttamalla tietopainiketta.";


/* Not enough free space for SW download error description */
"There is not enough free space on your startup disk to download the selected software. Please make more space available on your startup disk by deleting files and try again." = "Käynnistyslevyllä ei ole tarpeeksi vapaata tilaa valitun ohjelmiston lataamiseen. Vapauta tilaa käynnistyslevyltä poistamalla tiedostoja ja yritä uudelleen.";

/* Not enough free space for SW installation check failed error description */
"OSPNotEnoughAvailableSpaceToInstall" = "HP Easy Start vaatii vähintään %1$@ vapaata tilaa käynnistyslevyltä valittujen kohteiden lataamiseen. Käytettävissä on vain %2$@. Vapauta tilaa käynnistyslevyltä poistamalla tiedostoja ja yritä uudelleen.";

/* Accessibility title for untitled Search button in Select Printer window. */
"OSPSearchButton" = "Haku";

/* Name of IPP protocol in the system Add Printer dialog */
"OSPIPPProtocolTitle" = "Internet Printing Protocol - IPP";
/* Name of LPD protocol in the system Add Printer dialog */
"OSPLPDProtocolTitle" = "Line Printer Daemon - LPD";
/* Name of HP Jetdirect protocol in the system Add Printer */
"OSPJetDirectProtocolTitle" = "HP Jetdirect - Socket";

/* The names of the AirPrint and Secure AirPrint printer software. Localized strings should match to systems ones displayed in the Add Printer dialog */
"OSPPrinterSoftwareAirPrint" = "AirPrint";
"OSPPrinterSoftwareSecureAirPrint" = "Secure AirPrint";

/* Single byte size format */
"OSPByteSizeFormat" = "%zd tavu";

/* Multiple bytes size format */
"OSPBytesSizeFormat" = "%zd tavua";

/* KB size format */
"OSPKBSizeFormat" = "%zd kt";

/* MB size format */
"OSPMBSizeFormat" = "%.1f Mt";

/* GB size format */
"OSPGBSizeFormat" = "%.2f Gt";

/* TB size format */
"OSPTBSizeFormat" = "%.2f Tt";

/* The information to show in the Install screen when there are no software packages available for selected AirPrint compatible device. %1$@ - model name, %2$@ - OS X version number */
"OSPInfoMessageNoSoftwareForAirPrintDevice" = "HP-ohjelmisto AirPrint-yhteensopivaan laitteeseen %1$@ on saatavilla vain OS X %2$@ -käyttöjärjestelmään tai sitä uudempaan. Suorita asennus AirPrint-sovellusta käyttäen valitsemalla Jatka.";

/* The information to show in the Install screen when there are no software packages available for selected device on user’s OS. %1$@ - model name, %2$@ - OS X version number */
"OSPInfoMessageNoSoftwareForDevice" = "HP:n ohjaimet laitteelle %1$@ ovat saatavilla vain OS X %2$@ -käyttöjärjestelmään tai sitä uudempaan. Päivitä tietokoneen käyttöjärjestelmä ja asenna sitten HP:n uusimmat ohjaimet.";

/* Continue online screen message in case the device is AirPrint capable and no HP software is installed */
"Now that you are connected, remaining setup tasks will occur online." = "Yhteys on nyt muodostettu. Jäljellä olevat määritystehtävät suoritetaan verkossa.";

/* Enable logging info sheet title */

/* Enable logging info sheet informative text */

/* Enable logging info sheet button titles */


/* Enable logging checkbox title */
"Enable Logging" = "Salli kirjaaminen";

/*////////////////////////////////////////////////////////////////////////////*/
/* New licence aggreement strings */

"Agreements and Settings" = "Sopimukset ja asetukset";

"AgreementsAndSettingsScreenCescription" = "HP kerää ja analysoi tuotteiden, ohjelmistojen ja palveluiden käytöstä ja teknisiä tietoja laitteestasi, jotta voimme tarjota sinulle tuotteitamme ja palveluitamme, mukaan lukien päivitykset ja ilmoitukset, sekä jotta voimme toimittaa hyödyllisiä tietoja ja etuja sekä jotta voimme kehittää tuotteitamme, palveluitamme ja liiketoimintatoimenpiteitä. HP saattaa myös analysoida yhdessä HP:n yksityisyydensuojalausekkeen mukaan kerättyjä henkilökohtaisia tietoja sinulta, muilta HP-asiakkailta tai kolmansilta osapuolilta.\n\nTutustu seuraaviin sopimuksiin ja asetuksiin ja ilmaise, että hyväksyt ne.";

/* First agreement: Information collected during setup.  See also "Information Collected.rtf" */

"Information Collected During the Setup Process" = "Asennuksen aikana kerätyt tiedot";

"Disclosure of the information collected by HP during the setup process." = "HP:n asennuksen aikana keräämien tietojen käyttäminen";

/* Second agreement: EULA */
"End User License Agreement" = "Loppukäyttäjän käyttöoikeussopimus";

"The legal agreement between HP and users of this software." = "HP:n ja tämän ohjelmiston käyttäjän välinen lakiasioita koskeva sopimus";

/* Third agreement: Usage Tracking.  See also  "Product Improvement.rtf" */
 
"Product Improvement Data Collection (Recommended)" = "Tuotteiden kehittämistä varten kerätyt tiedot (suositus)";
"To improve HP products and solutions, better understand customers and develop strategic business initiatives, HP uses tools, including Google Analytics, to collect, combine and analyze data that contains no personally identifiable information." = "To improve HP products and solutions, better understand customers and develop strategic business initiatives, HP uses tools, including Google Analytics, to collect, combine and analyze data that contains no personally identifiable information.";


"Allow HP to collect data for Product Improvements" = "Antaa HP:lle luvan kerätä ja analysoida tuotteen ja ohjelmiston käyttötietoja";

/* Miscellaneous */

"HP Privacy Statement" = "HP:n Yksityisyydensuojalauseke";



/* Printer - specific strings adjustments */

/* HP Smart print details explanation */
"In just a few steps, your HP printer or scanner will be ready for use!" = "Vain muutaman toimenpiteen jälkeen HP-tulostimesi tai -skannerisi on valmis käyttöön!";

/* Click continue message on prepare printer view */
"Click Continue once these preliminary tasks have been completed." = "Valitse Jatka, kun nämä esivalmistelut on tehty.";

/* Ensure supplies are installed message on prepare printer view */
"Supplies are installed, if applicable" = "Tarvikkeet on asennettu, jos tarpeen";

/* Ensure network connection message on prepare printer view */
"If you do not intend to use a wireless connection, then attach the proper cable (USB or Ethernet) from your device to your Mac or wired network." = "Jos et aio käyttää langatonta yhteyttä, kytke oikeanlainen johto (USB tai Ethernet) laitteestasi Mac-tietokoneeseesi tai langalliseen verkkoon.";

/* Refer to the information message on prepare printer view */
"If you need assistance with any of these tasks, refer to the information provided with your HP product." = "Jos tarvitset apua näissä toimenpiteissä, saat lisätietoa HP-tuotteesi kanssa toimitetuista materiaaleista.";

/* Unconfigured device display name */
"New Wireless Device" = "Uusi langaton laite";

/* Printer selection view description */
"Select the device you want to use and then click Continue." = "Valitse haluamasi laite ja napsauta Jatka-painiketta.";

/* Device configuration error text */
"An error occurred during the configuration attempt. Reset the device to its default settings, and then try again." = "Määritysvaiheessa tapahtui virhe. Palauta laite sen oletusasetuksiin ja yritä uudelleen.";

/* Alert explanation text displayed when the printer doesn't support LEDM configuration */
"Your device does not support wireless setup over a wireless network. Please refer to the product’s documentation for more information." = "Laitteesi ei tue langatonta asennusta langattomassa verkossa. Lisätietoja saat tuotteen käyttöoppaista.";

/* Alert info on timeout while restoring connection */
"The device was not found on your wireless network. Click Wait to continue searching, or click Reconfigure to start the configuration again from the beginning. Click Cancel to select another device." = "Laitetta ei löytynyt langattomassa verkossasi. Jos haluat jatkaa etsintää, napsauta Odota-painiketta tai jos haluat aloittaa määrittämisen uudelleen alusta, napsauta Määritä uudelleen. Jos haluat valita toisen laitteen, napsauta Peruuta-painiketta.";

/* Setup completion messages on the finish screen */
"Your HP product setup is complete" = "HP-tuotteesi asennus on valmis";
"Your device is set up and ready to use." = "Laitteesi on määritetty ja valmis käytettäväksi";
"Now that you are connected and essential software is installed, use HP Utility to complete remaining printer setup tasks." = "Nyt kun olet luonut yhteyden ja tarpeelliset ohjelmistot on asennettu, suorita seuraavat asennustoimenpiteet HP Utility -apuohjelman avulla.";

/* Renaming device title and description*/
"Rename Device (Optional)" = "Laitteen nimeäminen uudelleen (valinnainen)";

/* Renaming device error title and description */
"Cannot change device name." = "Laitteen nimen vaihtaminen ei onnistu.";
"Renaming the device was unsuccessful. You may try again, try using a different name, or proceed with the device’s present name." = "Laitteen nimen vaihtaminen ei onnistunut. Voit yrittää nimen vaihtamista uudelleen, käyttää toista nimeä tai jatkaa laitteen käyttämistä sen nykyisellä nimellä.";

/* Warning displayed in case user selects AirPrint and generic drivers for device on enable printing screen */
"An AirPrint printer driver is assigned to your printer. This driver provides basic features and is supported for use with your printer. However, to ensure access to all of the features of your printer it is recommended that you use the HP printer driver." = "AirPrint-tulostinohjain on määritetty tulostimellesi. Tämä ohjain tarjoaa perustoiminnot ja tulostimesi tukee sitä. Jotta kuitenkin voisit käyttää tulostimesi kaikkia toimintoja, on suositeltavaa käyttää HP:n tulostinohjainta.";
"A generic printer driver is assigned to your printer. This driver provides basic features and is supported for use with your printer. However, to ensure access to all of the features of your printer it is recommended that you use the HP printer driver." = "Yleinen tulostinohjain on määritetty tulostimellesi. Tämä ohjain tarjoaa perustoiminnot ja tulostimesi tukee sitä. Jotta kuitenkin voisit käyttää tulostimesi kaikkia toimintoja, on suositeltavaa käyttää HP:n tulostinohjainta.";

/* Software installation screen description */
"Download and install the recommended software for your HP product." = "Lataa ja asenna HP-tuotteellesi suositeltu ohjelmisto.";

/* Device search/discovery messages */
"Turn your Mac's Wi-Fi on to discover available devices." = "Ota Mac-tietokoneesi Wi-Fi-yhteys käyttöön, jotta löydät käytettävissä olevat laitteet.";
"Searching for device with IP address: %@" = "Etsitään laitetta, jonka IP-osoite on: %@";
"Filter the listed devices, or enter an IP address or host name." = "Suodata luettelossa olevat laitteet tai anna IP-osoite tai isännän nimi.";
"Devices matching %@" = "Arvoa %@ vastaavat laitteet"; 
"Cannot find device." = "Laitetta ei löydy.";
"Searching for device with host name: %@" = "Etsitään laitetta, jonka isäntänimi on: %@";


/* Printer configuration */
"Set Up My HP Product" = "HP-tuotteen asentaminen";


/* Device configuration error alert title */

/* Alert about necessity to change user's network settings to connect to device setup network */
"To configure the device, HP Easy Start needs to temporarily change your connection settings. Authorization is required." = "Jotta laite voitaisiin määrittää, HP Easy Start -ohjelman pitää muuttaa tilapäisesti yhteysasetuksiasi. Tämä vaatii käyttöoikeuksien myöntämistä.";

/* 5 GHz wireless network connection error alerts */
"Your device is not compatible with 5 GHz networks. Select another network, and then try again." = "Laitteesi ei ole yhteensopiva 5 GHz:n verkkojen kanssa. Valitse toinen verkko ja yritä uudelleen.";
"Your device cannot be connected to the %1$@ network channel. Supported channels are %2$@. Set up your router to use one of the supported channels, or select another network." = "Laitettasi ei voida yhdistää %1$@ -verkkokanavaan. Tuetut kanavat ovat %2$@. Määritä reititin käyttämään yhtä tuetuista kanavista tai valitse toinen verkko.";
"Your device cannot be connected to the %@ network channel. Set up your router to use another channel, or select another network." = "Laitettasi ei voida yhdistää %1$@ -verkkokanavaan. Määritä reititin käyttämään yhtä tuetuista kanavista tai valitse toinen verkko.";

/* Device setup error alert title */

/* Device setup progress messages */
"Gathering device information..." = "Haetaan laitteen tietoja...";


/* USB device busy error allert title and description */
"The device is busy" = "Laite on varattu";
"Your device is being used by the operating system or some other application. Try again later or restart the device." =  "Laitetta käyttää käyttöjärjestelmä tau joku muu sovellus. Yritä uudelleen tai käynnistä laite uudelleen.";

/* Device communication error title and messages */
"Unable to communicate with the device." = "Yhteyden luominen laitteeseen ei onnistunut.";
"Make sure that your device is powered on, and connected to your network. Also check assigned device host name or IP-address, and ensure that your search information is typed correctly. Click the Information button for more tips to follow if your device is still not found." = "Varmista, että laitteessa on virta päällä ja että se on yhdistetty verkkoosi. Tarkista myös sille määritetty isäntänimi tai IP-osoite ja varmista, että hakusanat on kirjoitettu oikein. Napsauta Tiedot-painiketta, jos laitetta ei vieläkään löydy ja tarvitset lisävihjeitä sen etsimiseen.";

"The user name and password assigned to this device by your administrator are required to perform this task." = "Järjestelmänvalvojan tälle laitteelle määrittämä käyttöjätunnus ja salasana vaaditaan tämän tehtävän suorittamiseen.";



/* Setup locale and language title and description */


/* Join wireless network progress reporting */ 
"Preparing for setup..." = "Asennusta valmistellaan...";
"Connecting to the device..." = "Luodaan yhteyttä laitteeseen...";
"Setting up the device..." = "Asennetaan laitetta...";

"Restoring your network connection..." = "Verkkoyhteyttä palautetaan...";
"Verifying the device settings..." = "Tarkistetaan laitteen asetuksia...";
"Your device is now connected." = "Laitteesi on nyt yhdistetty verkkoon.";

/* Enable printing/scanning screen title and description */

/* For single-function printers */
"Enable Printing" = "Tulostamisen ottaminen käyttöön";

/* For multi-function printers */
"Enable Print and Scan" = "Tulostamisen ja skannaamisen ottaminen käyttöön";
"Follow these steps to prepare to print and scan." = "Valmistele laite tulostamista ja skannaamista varten seuraavasti.";

/* For single-function scanners */
"Enable Scanning" = "Skannaamisen ottaminen käyttöön";
"Follow these steps to prepare for scanning." = "Valmistele laite skannaamista varten.";

/* Scan test page description */
"To ascertain that the scanner has been successfully configured, place a document in the scanner according to the device’s placement markings, and then click Scan Test Page." = "Varmista, että skanneri on määrittty oikein asettamalla asiakirja skanneriin ohjausmerkkien mukaisesti ja valitse Skannaa testisivu.";

/* Scanning unavailable due to unsupported connection error alert title and description */
"Unsupported connection type." = "Tätä yhteystyyppiä ei tueta.";
"Scanning functions will not be available" = "Skannaustoiminnot eivät ole käytettävissä.";
"OS X does not support scanning on devices connected via host name or IP-address methods. You may continue to setup this device for printing only.  To scan, enable Bonjour on your device, ensure that the device is connected to the same local network as your Mac, and then select the device again when it appears in the list." = "OS X ei tue skannausta laitteilla, joiden yhteystyyppi on isännän nimi tai IP-osoite. Voit jatkaa laitteen asentamista vain tulostamista varten. Jos haluat skannata, ota Bonjour käyttöön laitteessasi, varmista, että laite on yhteydessä samaan verkkoon kuin Mac-tietokoneesi ja valitse laite uudelleen, kun se ilmestyy luetteloon.";

"OS X does not support scanning on devices connected via host name or IP-address methods.  Please enable Bonjour on your device, ensure that the device is connected to the same local network as your Mac, and then select the device when it appears in the list." = "OS X ei tue skannausta laitteilla, joiden yhteystyyppi on isäntänimi tai IP-osoite. Voit jatkaa laitteen asentamista vain tulostamista varten. Jos haluat skannata, ota Bonjour käyttöön laitteessasi, varmista, että laite on yhteydessä samaan verkkoon kuin Mac-tietokoneesi ja valitse laite uudelleen, kun se ilmestyy luetteloon.";

/* Scan test page info messages */ 
"Connecting to the scanner..." = "Luodaan yhteyttä skanneriin...";
"The scanner reported an error" = "Skanneri antoi virheilmoituksen.";
"Scanning..." = "Skannataan...";
"The scanner is warming up..." = "Skanneri lämpiää...";
"A document is not loaded" = "Asiakirjaa ei ole paikallaan.";

/* Test page control titles */
"Scan" = "Skannaa";

"Print" = "Tulosta";
"Scan Test Page" = "Skannaa testisivu";

/* Create device queue instruction and button title */
"Add Device..." = "Lisää laite...";

/* ScanJet selection instruction */
"Select \"%1$@\" with Location value \"%2$@\"" = "Valitse \"%1$@\" ja sijaintiarvoksi \"%2$@\"";

/* Error alert description in case USB device */

/* App log location description */
"Logged information will be saved to \"%1$@\" in your %2$@ folder." = "Kirjatut tiedot tallennetaan kohteeseen \"%1$@\" %2$@ -kansioosi.";

/* 2.2.4 strings */
"Confirm that your scanner is functioning properly." = "Vahvista, että skannerisi toimii oikein.";
"The selected network is not reachable from your HP device. Try to relocate the device closer to your wireless router or access point." = "Valittuun verkkoon ei pääse HP-laitteeltasi. Yritä sijoittaa laitteesi uudelleen lähemmäksi langatonta reititintä tai käyttöpistettä.";
"Google Analytics Privacy Policy" = "Google Analytics -tietosuojakäytäntö";
"The scanner was added successfully." = "Skannerin lisäys onnistui.";
"Your %1$@ device is supported for use on OS X %2$@ or later. Please update your computer's operating system." = "%1$@ -laitettasi on mahdollista käyttää OS X %2$@:n tai sitä uudemman käyttöjärjestelmäversion kanssa. Päivitä tietokoneesi käyttöjärjestelmä.";
"Test Your Scanner" = "Testaa skanneri";
"Place an item on the scanner and try again." = "Sijoita kohde skanneriin tai yritä uudelleen.";
"Check that the USB cable is securely connected to the USB ports on the device and your Mac." = "Tarkista, että USB-kaapeli on liitetty tiukasti laitteen ja Mac-tietokoneen USB-portteihin.";
"Cannot configure the device software." = "Laiteohjelmiston määritys ei onnistu.";
"Make sure all device cables are securely connected, or that the wireless connection is working properly, and then try again." = "Varmista, että kaikki laitteen kaapelit on turvallisesti liitetty tai että langaton yhteys toimii oikein, ja yritä sitten uudelleen.";
"ReviewedCheckboxTitle" = "Olen tarkistanut ja hyväksynyt  sopimukset ja asetukset.";
"Your Mac login password is required to complete this step." = "Mac-kirjautusmisalasanaasi tarvitaan tämän vaiheen suorittamiseksi.";
"Make sure your device is powered on and connected to the network, and then try again." = "Varmista, että laitteesi on kytketty päälle ja yhdistetty verkostoon, ja yritä sitten uudelleen.";
"HP scanner drivers for your %1$@ device are only available for OS X %2$@ or later. Please update your computer's operating system and then install the latest HP drivers." = "%1$@-laitteesi HP-skanneriohjaimet ovat käytettävissä vain käyttöjärjestelmässä OS X %2$@  tai sitä uudemmassa käyttöjärjestelmäversiossa. Päivitä tietokoneesi käyttöjärjestelmä ja asenna sitten viimeisimmät HP-ohjaimet.";
"Creating the printer queue..." = "Tulostusjonon luominen...";
"To ascertain that the printer has been successfully configured, ensure there is paper in the printer's paper tray, and then click Print Test Page." = "Varmistaaksesi, että tulostin on varmasti määritetty, tarkista, että tulostinlokerossa on paperia, ja napauta sitten Tulosta testisivu -kohtaa.";
"Connecting to the scanner. Please wait..." = "Yhdistetään skanneriin. Odota...";
"Your Mac login credentials are required to grant HP Easy Start permission to install software on this computer. Click OK and then try again." = "Mac-kirjautumistunnuksiasi tarvitaan luvan antamiseen HP Easy Startille ohjelmiston asentamiseksi tähän tietokoneeseen. Napsauta kohtaa OK ja yritä sitten uudelleen.";
"The %@ IP address is not reachable." = "IP-osoiteeseen %@ ei voida muodostaa yhteyttä.";
"The IP address you provided is located on a different IP network and cannot be accessed from your Mac." = "Antamasi IP-osoite sijaitsee eri IP-verkostossa, ja sitä ei voi käyttää Mac-tietokoneella.";
"Click to setup the scanner in the system" = "Määritä skanneri järjestelmään napauttamalla";
"To perform this optional step, place a single-page document on the scanner according to the placement markings, and then click Scan Test Page. If working properly the scanned image will appear in the preview area." = "Suorita tämä valinnainen vaihe sijoittamalla yksisivuinen asiakirja skanneriin sijoitusmerkkien mukaisesti ja napauta sitten Skannaa testisivu -kohtaa. Â Jos kaikki toimii oikein, skannattu sivu ilmestyy esikatselukuva-alueelle.";
"Check that the USB cable is securely connected to the USB ports on the device and your Mac. If the device is still not found, disconnect the USB cable, wait a few moments, and then re-connect." = "Tarkista, että USB-kaapeli on liitetty tiukasti laitteen ja Mac-tietokoneen USB-portteihin. Jos laitetta ei vieläkään löydy, irrota USB-kaapeli, odota muutama sekunti ja liitä sitten USB-kaapeli uudelleen.";
"ProductImprovementDescription" = "HP-tuotteiden ja ratkaisujen parantamiseksi, asiakkaan ymmärtämiseksi entistä paremmin ja strategisten liiketoiminta-aloitteiden kehittämiseksi HP käyttää työkaluja, kuten Google Analyticsia, tietojen keräämiseksi, yhdistämiseksi ja analysoimiseksi. Nämä tiedot eivät sisällä henkilökohtaisesti tunnistettavia tietoja.";

/* Scan queue creation action title */
"Add this scanner to the System Preferences \"Printers & Scanners\" list." = "Lisää tämä skanneri Järjestelmäasetusten luetteloon Tulostimet & Skannerit.";

/* Add print queue button description */
"Add this printer to the System Preferences \"Printers & Scanners\" list." = "Lisää tämä tulostin Järjestelmäasetusten luetteloon Tulostimet & Skannerit.";

/* Description for Print view in Enable Print and Scan page */
"To perform this optional step, place a sheet of %@ paper in the printer's paper tray, and then click Print Test Page." = "Suorita tämä valinnainen vaihe sijoittamalla paperiarkki (%@) tulostimen paperilokeroon ja napauttamalla sitten Tulosta testisivu.";


/* Title and description of the alert displayed in case app should be restarted to correctly handle HP software update */
"%@ Needs To Be Restarted" = "%@ täytyy käynnistää uudelleen";
"Setup of the selected device requires HP software update and restart of %@." = "Valitun laitteen määrittämiseen tarvitaan HP-ohjelmistopäivitys ja laitteen %@ käynnistäminen uudelleen.";

/* Create the print/scan queue action description*/
"Add this device to the System Preferences \"%@\" list." = "Lisää tämä laite järjestelmäasetusten %@-luetteloon.";
"Add this scanner to the System Preferences \"%@\" list." = "Lisää tämä laite järjestelmäasetusten %@-luetteloon.";

/* Name of Print & Scan System Preferences pane on OSX 10.8 and lower. The localized name should be the same as in the OSX System Preferences */
"Print & Scan" = "Tulostus ja skannaus";

/* Name of Print & Scan System Preferences pane on OSX 10.9 and higher. The localized name should be the same as in the OSX System Preferences */
"Printers & Scanners" = "Tulostimet ja skannerit";

/* Warning title and description in case the device is found via WSDiscovery but can not be discovered via Bonjour */
"Some of your device functions may be unavailable." = "Eräitä laitteen toimintoja ei välttämättä voi käyttää.";
"OS X supports scanning and faxing features for devices connected via Bonjour only, but this device can not be discovered via Bonjour. You may continue to setup this device for printing only. To use all device functions, enable Bonjour on your device, ensure that the device is connected to the same local network as your Mac, and then select the device again when it appears in the list." = "OS X tukee vain Bonjourin kautta yhdistettyjen laitteiden skannaus- ja faksiominaisuuksia, mutta tätä laitetta ei voi löytää Bonjourin kautta. Voit jatkaa tämän laitteen määrittämistä vain tulostusta varten. Jos haluat käyttää kaikkia laitteen toimintoja, ota Bonjour käyttöön laitteessa, varmista, että laite on liitetty samaan lähiverkkoon Mac-tietokoneen kanssa, ja valitse laite uudelleen, kun se tulee näkyviin luettelossa.";

/* Description and the button title displayed in case the print queue should be updated with ippusb scheme on 10.12 */
"Print queue for your device needs to be updated." = "Laitteen tulostusjono täytyy päivittää.";
"Update..." = "Päivitä...";

/* Warning description for the case user found ScanJet by IP-address or host name */
"OS X does not support scanning on devices connected via host name or IP-address methods. To scan, enable Bonjour on your device, ensure that the device is connected to the same local network as your Mac, and then select the device again when it appears in the list." = "OS X ei tue skannausta laitteilla, jotka on liitetty isäntänimen tai IP-osoitteen kautta. Jos haluat skannata, ota Bonjour käyttöön laitteessa, varmista, että laite on liitetty samaan lähiverkkoon Mac-tietokoneen kanssa, ja valitse laite uudelleen, kun se tulee näkyviin luettelossa.";

"To connect the device, complete the following steps. After you complete each step, click \"Try Again\".\n \n1. Make sure all cables are securely connected or that the wireless connection is working properly.\n\n2. Turn the device off, and then turn it on again" = "Yhdistä laite verkkoon seuraavasti. Kun olet tehnyt kaikki toimenpiteet, napsauta  Yritä uudelleen.\n\n1. Varmista, että kaikki johdot ovat tiukasti kytkettyinä tai että langaton yhteys toimii oikein.\n\n2. Sammuta laite ja käynnistä se uudelleen.";

/* Hardware Setup screen title, description and explanation */
"Hardware Setup" = "Laitteiston asetukset";
"Lets install ink and paper" = "Asennetaan muste ja paperi!";
"Follow the printed instructions that came with your device.\n\nAfter you've completed ink and paper installation, select <b>Continue</b>." = "Noudata laitteen mukana tulleita painettuja ohjeita.\n\nKun muste ja paperi on asennettu, valitse <b>Jatka</b>.";



/* Offline setup flow strings */

/* Online setup error title */
"Cannot establish connection for online setup." = "Yhteyttä online-asennusta varten ei voi muodostaa.";
/* Online setup error description in case software is not accessible  */
"Some of the device setup steps including HP software installation require Internet connection. Make sure your computer is connected to the Internet, and then click Try Again. Click Continue Offline to skip the online setup." = "Eräät laitteen asennusvaiheet, HP-ohjelmiston asennus mukaan lukien, tarvitsevat Internet-yhteyden. Varmista, että tietokone on yhdistetty Internetiin, ja napsauta sitten Yritä uudelleen. Ohita online-asennus napsauttamalla Jatka offline-tilassa.";
/* Online setup error description in case software is accessible */
"Some of the device setup steps including HP software installation require Internet connection. Make sure your computer is connected to the Internet, and then click Try Again. Click Continue Offline to skip the online setup steps and setup your device with AirPrint driver." = "Eräät laitteen asennusvaiheet, HP-ohjelmiston asennus mukaan lukien, tarvitsevat Internet-yhteyden. Varmista, että tietokone on yhdistetty Internetiin, ja napsauta sitten Yritä uudelleen. Ohita online-asennus napsauttamalla Jatka offline-tilassa ja asenna laitteen AirPrint-ajuri.";
/* Continue offline button title */ 
"Continue Offline" = "Jatka offline-tilassa";

/* Information text to the busy alert on trying to close download window */
"Software download is in progress. Please wait until download is completed." = "Ohjelmiston lataus on käynnissä. Odota, kunnes lataus on valmis.";

/* Confirmation button title on busy alert */
"Close Anyway" = "Sulje silti";

/* Information text to the busy alert on trying to quit application */
"You have an active downloading in progress. Please wait for downloading completion or cancel active downloads." = "Käynnissä on keskeneräinen lataus. Odota, kunnes lataus on valmis, tai peruuta käynnissä olevat lataukset.";

/* The information text to the download failure alert, when the reason is unknown */
"The software cannot be downloaded. Try again later." = "Ohjelmistoa ei voida ladata. Yritä uudelleen myöhemmin.";

/* Switch to Bonjour connection proposal screen */

/* Screen Title */
"Enable Bonjour" = "Ota Bonjour käyttöön";

/* Title and description for the message displayed in case the device found by IP-address is also available via Bonjour */
"Your device is available via Bonjour connection." = "Laite on käytettävissä Bonjour-yhteyden kautta.";
"Using Bonjour allows you to have more features and options for work with your device." = "Bonjour-yhteyden ansiosta laitteelle on saatavilla enemmän ominaisuuksia ja vaihtoehtoja.";

/* Radio buttons for selecting connection */
"Use Bonjour connection" = "Käytä Bonjour-yhteyttä";
"Use current connection" = "Käytä nykyistä yhteyttä";


/* Message text for MFU found by IP-address or WS-Discovery */
"OS X supports scanning and faxing features for devices connected via Bonjour only, but this device can not be discovered via Bonjour. You may continue to setup this device for printing only. To use all device functions, enable Bonjour on your device, ensure that the device is connected to the same local network as your Mac." = "OS X tukee vain Bonjour-yhteyden kautta yhdistettyjen laitteiden skannaus- ja faksausominaisuuksia, mutta tätä laitetta ei löydetä Bonjour-yhteyden kautta. Voit jatkaa tämän laitteen asentamista vain tulostusta varten. Jos haluat käyttää kaikkia laitteen toimintoja, ota Bonjour käyttöön laitteessa ja varmista, että laite on yhdistetty samaan lähiverkkoon kuin Mac.";


/* Message text for scanner found by IP-address or WS-Discovery */
"OS X supports scanning for devices connected via Bonjour only, but this device can not be discovered via Bonjour. Please enable Bonjour on your device, ensure that the device is connected to the same local network as your Mac." = "OS X tukee vain Bonjour-yhteyden kautta yhdistettyjen laitteiden skannausominaisuutta, mutta tätä laitetta ei löydetä Bonjour-yhteyden kautta. Ota Bonjour käyttöön laitteessa ja varmista, että laite on yhdistetty samaan lähiverkkoon kuin Mac.";


/* Wireless setup over USB */

/* Screen title and description */
"Connect device to the wireless network" = "Yhdistä laite langattomaan verkkoon";
"Your device supports wireless network connection." = "Laite tukee langatonta verkkoyhteyttä.";


/* Radio buttons for selecting connection */
"Connect to wireless network" = "Muodosta yhteys langattomaan verkkoon";
"Continue with USB connection" = "Jatka USB-yhteyden kanssa";

/* Error message for USB device setup error */
"Check that the USB cable is securely connected to the USB ports on the device and your Mac. If still not working, turn your device off, wait a few moments, and turn it on again." = "Tarkista, että USB-kaapeli on kytketty kunnolla laitteen ja Macin USB-portteihin. Jos se ei vieläkään toimi, sammuta laite, odota muutama hetki ja käynnistä se uudelleen.";

/* Title and description for message that tells user device is to be unplugged from USB */
"Unplug your device from USB." = "Kytke laite irti USB-portista.";
"Please unplug your device from USB to start using the network connection." = "Aloita verkkoyhteyden käyttö kytkemällä laite irti USB-portista.";


/* SW Download */

/* Search field placeholder */
"Device model name" = "Laitteen mallinimi";

/* Initial action description */
"Enter the device model name to start searching for software online." = "Aloita ohjelmiston online-haku syöttämällä laitteen mallinimi.";

/* Done button title */
"New Download" = "Uusi lataus";


/* Print/scan test page action description */
"To ascertain that the printer has been successfully configured, ensure there is paper in the printer's paper tray, and then click %@." = "Varmista, että tulostimen määritys onnistui: varmista, että tulostimen paperialustalla on paperia, ja napsauta sitten %@.";
"To perform this optional step, place a single-page document on the scanner according to the placement markings, and then click %@. If working properly the scanned image will appear in the preview area." = "Kun haluat suorittaa tämän valinnaisen vaiheen, aseta yksisivuinen asiakirja skannerille sijoitusmerkkien mukaisesti ja napsauta sitten %@. Jos laite toimii oikein, skannattu kuva tulee esiin esikatselualueella.";

"To perform this optional step, place a sheet of %@ paper in the printer's paper tray, and then click %@." = "Kun haluat suorittaa tämän valinnaisen vaiheen, aseta yksi arkki %@-paperia tulostimen paperialustalle ja napsauta sitten %@.";

/* Alert message for case user connects to the wireless network, but the specific band is turned off on the device control panel */
"%@ Wi-Fi band frequency support is turned off. Please turn it on in the device control panel, or select another network." = "%@ Wi-Fi-kaistan taajuustuki on pois päältä. Kytke se päälle laitteen ohjauspaneelista tai valitse toinen verkko.";

/* Wireless channel bands */
"2.4GHz" = "2,4 GHz";
"5GHz" = "5 GHz";

/* Select device screen description. The bold text is marked with <b>..</b> */
"Select the device you want to use and then click <b>Continue</b>." = "Valitse laite, jota haluat käyttää, ja napsauta sitten <b>Jatka</b>.";

/* Join Wi-Fi network action note. The bold text is marked with <b>..</b> */
"Note: When you click <b>Join</b>, your Mac will be temporarily disconnected from your wireless network. %@" = "Huomaa: Kun napsautat <b>Liitä</b>, Macin langaton verkkoyhteys katkeaa tilapäisesti. %@";

/* Join Wi-Fi screen description. The bold text is marked with <b>..</b> */
"Click on the label under device icon and give your device a name that will be easy to recognize, make sure your Mac’s current Wi-Fi network is selected, and then click <b>Join</b>." = "Napsauta laitekuvakkeen alapuolella olevaa etikettiä ja anna laitteelle helposti tunnistettava nimi. Varmista, että Macin nykyinen Wi-Fi-verkko on valittu, ja napsauta sitten <b>Liitä</b>.";

/* Open HP Utility and Continue Online screen descriptions. The bold text is marked with <b>..</b> */
"Click <b>Open HP Utility</b> and then follow the steps presented. Once HP Utility has opened, HP Easy Start will automatically close." = "Napsauta <b>Avaa HP Utility</b> ja noudata esiin tulevia vaiheita. Kun HP Utility on avattu, HP Easy Start sulkeutuu automaattisesti.";
"Click <b>Continue Online</b> to open your Web browser and then follow the steps presented. Once your browser has opened, HP Easy Start will automatically close." = "Avaa WWW-selain napsauttamalla <b>Jatka verkossa</b> ja noudata esiin tulevia vaiheita. Kun selain on avattu, HP Easy Start sulkeutuu automaattisesti.";

/* The first screen description */
"Power on your device to quickly and easily set up, connect, and begin printing with HP Easy Start. In a few simple steps, your HP printer or scanner will be ready to use!" = "Kytke laitteeseen virta ja asenna, yhdistä ja aloita tulostus nopeasti ja helposti HP Easy Start -sovelluksen avulla. HP-tulostin tai -skanneri on käyttövalmis muutaman yksinkertaisen vaiheen jälkeen!";

/* Controls caption for case locale/language was not initially set */
"Select Country..." = "Valitse maa...";
"Select Language..." = "Valitse kieli...";

/* Enable Bonjour screen descriptions for scanners */
"Bonjour connection is required for scanning." = "Skannaukseen tarvitaan Bonjour-yhteys.";

/* Proceed with Bonjour connection action description for scanners */ 
"Click <b>Continue</b> to proceed with Bonjour connection." = "Jatka Bonjour-yhteyden kanssa napsauttamalla <b>Jatka</b>.";

/* Add printer/print test page screen title and description */
"Add and Verify Your Device" = "Lisää ja vahvista laite"; 
"Follow these steps to prepare the device for work." = "Valmistele laite työtä varten noudattamalla näitä ohjeita.";

/* Quit application during online setup alert message header */
"Setup not complete" = "Asennus ei valmis";

/* Quit application during online setup alert message details button titles are "Continue", "Skip to Software Download" and "Quit"*/
"If you close %1$@, you might not be able to print from this computer.\nEven though you have connected your printer to a network, you will still need to install print drivers.\nAdditionally, if you close this window now, your supplies might not be configured properly.\nClick <b>%2$@</b> to continue set up (recommended), <b>%3$@</b> to download and install printer drivers, or <b>%4$@</b> to quit the application." = "Jos %1$@ suljetaan, tästä tietokoneesta ei välttämättä voi tulostaa.\nVaikka tulostin olisi yhdistetty verkkoon, tulostusajurit täytyy silti asentaa.\nLisäksi, jos suljet tämän ikkunan nyt, tarvikkeita ei välttämättä konfiguroida oikein.\nJatka asennusta napsauttamalla <b>%2$@</b> (suositus), lataa ja asenna tulostinajurit napsauttamalla <b>%3$@</b> tai sulje sovellus napsauttamalla <b>%4$@</b>.";

/* Skip online setup button title */
"Skip to Software Download" = "Siirry ohjelmiston lataukseen";

/* Quit application during online setup button title */
"Quit" = "Lopeta";

"Welcome to %@!" = "Tervetuloa %@iin!";
"Power on your device to easily set up, connect, and begin printing with HP Easy Start.\nLet's get your HP printer or scanner ready to use!" = "Käynnistä vain laitteesi, ja voit HP Easy Startin avulla asentaa ja yhdistää sen sekä aloittaa tulostuksen.\nValmistellaan HP-tulostimesi tai -skannerisi käyttöä varten!";
I_Have_Read_Agreement_prefix = "Olen lukenut ja hyväksyn ";
"End_User_License_Agreement" = "ohjelmiston käyttöoikeussopimuksen";
" and " = " ja ";
"Privacy Statement" = "tietosuojalausunnon";
I_Have_Read_Agreement_suffix = ".";
User_Settings_prefix = "Lue lisää tai muuta käyttäjäasetuksia ";
"click here" = "napsauttamalla tätä";
User_Settings_suffix = ".";
"User Settings" = "Käyttäjäasetukset";
"Allow usage information to be sent" = "Salli käyttötietojen lähetys";
"HP collects and analyzes printer usage and technical data from HP devices for the purposes of providing and improving products, services and business operations, and delivering relevant information and benefits. HP may also analyze this data in combination with other data collected in accordance with the HP Privacy Statement." = "HP kerää ja analysoi HP:n laitteilta saatavia tulostinten käyttötietoja ja teknisiä tietoja, joiden avulla se pyrkii tarjoamaan ja parantamaan tuotteita, palveluita ja liiketoimintaa sekä tarjoamaan ajankohtaisia tietoja ja etuja. HP voi myös analysoida näitä tietoja yhdessä muiden HP:n tietosuojalausunnon mukaisesti kerättyjen tietojen kanssa.";
"Allow your %@ software to send data to HP" = "Salli %@ -ohjelmiston lähettää tietoja HP:lle";
"In order to deliver better versions of your %@ software, HP will periodically collect anonymous usage data (some information may be collected using Google Analytics) and transmit that data to HP." = "Jotta HP voi tarjota %@ista entistä parempia versioita, se kerää kausittain nimettömiä käyttötietoja (joidenkin tietojen keräämiseen saatetaan käyttää Google Analyticsia) ja välittää tiedot HP:lle.";
"Click here to learn more about Google Analytics" = "Lue lisää Google Analyticsista napsauttamalla tätä";
"Prepare printer for setup" = "Valmistele tulostin asennusta varten";
"Click <b>Continue</b> after you complete the following tasks." = "Suorita seuraavat toimenpiteet ja napsauta sitten <b>Jatka</b>.";
"Make sure the printer is plugged into a power source" = "Varmista, että tulostin on kytketty virtalähteeseen";
"Make sure the printer is turned ON" = "Varmista, että tulostin on PÄÄLLÄ";
"For wireless printer setup, remove any Ethernet or USB cables that might be connected to your printer" = "Langatonta tulostinasennusta varten täytyy irrottaa tulostimeen kytketyt Ethernet- ja USB-kaapelit";
"For assistance with these tasks, consult the information provided with your printer." = "Jos tarvitset apua näissä toimenpiteissä, tutustu tulostimen mukana toimitettuihin tietoihin.";

/*////////////////////////////////////////////////////////////////////////////*/
/*                                                                            */
/*                            Hawk Specific                                   */
/*                                                                            */
/*////////////////////////////////////////////////////////////////////////////*/

"Download" = "Lataa";
/* Menu item to create new window */
"New Download Window" = "Uusi latausikkuna";

/* Main screen title */
"Download Software" = "Lataa ohjelmisto";

/* Helping description on the main screen to the seatch field */
"Enter the device model name to start searching for software" = "Aloita ohjelmistohaku antamalla laitteen mallinumero";

/* Stub message when search field is empty and no model is selected */
"No model selected" = "Mallia ei ole valittu";

/* Title of link to open location of downloaded software component in Finder */
"Show In Finder" = "Näytä Finderissa";
